EA/src/Documents/КомплектацияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>КомплектацияЗаказов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыКСборке</xr:Item>
				<xr:Item>AccumulationRegister.ХранениеЗСЯ</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ХранениеЗСЯПоТоварам</xr:Item>
				<xr:Item>InformationRegister.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Сборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Холод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектацияЗавершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплектация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗСЯ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестоЗСЯ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеХватило</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрогрессКомплектации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗСЯ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестоЗСЯ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/InformationRegisters/КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗСЯ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестоЗСЯ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/AccumulationRegisters/ХранениеЗСЯ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ХранениеЗСЯ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаклейкиМестЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗСЯ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестоЗСЯ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EA/src/AccumulationRegisters/ТоварыКСборке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКСборке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоКСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНаКомплектации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНеХватило</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыРезервирующиеТовар</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСборки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСборки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EA/src/AccumulationRegisters/ХранениеЗСЯПоТоварам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ХранениеЗСЯПоТоварам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗСЯ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестоЗСЯ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EA/src/Enums/ТипСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СборкаЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборкаПеремещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборкаЗаказовИзКоробки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеРезерваПоОтмененнымЗаказам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчисткаЯчеекОтТоваровПоОтмененнымЗаказам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

EA/src/Documents/КомплектацияЗаказов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.Очистить();
	Движения.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.Записывать = Истина;	
	
	Движения.ХранениеЗСЯ.Очистить();
	Движения.ХранениеЗСЯ.Записывать = Истина;

	
	Движения.ТоварыКСборке.Очистить();
	Движения.ТоварыКСборке.Записывать = Истина;
		
	Движения.ХранениеЗСЯПоТоварам.Очистить();
	Движения.ХранениеЗСЯПоТоварам.Записывать = Истина;

	
	ТаблицаКомплектацияСвернуто = Комплектация.Выгрузить(,"Заказ,ЗСЯ");
	ТаблицаКомплектацияСвернуто.Свернуть("Заказ,ЗСЯ");
	
	ТипСборки = ДокументОснование.ТипСборки;
	Для каждого строка из ТаблицаКомплектацияСвернуто цикл
		Движение = 	Движения.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.Добавить();
		Движение.Период = Дата;
		Движение.Заказ = Строка.Заказ;
		Движение.ЗСЯ = Строка.ЗСЯ;
	КонецЦикла;
	Если КомплектацияЗавершена тогда
		Для каждого Строка из Комплектация цикл
			Если Строка.Количество > 0 тогда
				Движение = Движения.ТоварыКСборке.ДобавитьРасход();	
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Документ = Строка.Заказ;
				Движение.Товар = Строка.Товар;
				Если ТипСборки <> Перечисления.ТипСборки.СборкаЗаказовИзКоробки тогда
					Движение.Партия = Строка.Партия;
				КонецЕсли;
				Движение.КоличествоНаКомплектации = Строка.Количество;			
				Движение.КоличествоНеХватило = 0;
				Движение.ТипСборки = ?(ЗначениеЗаполнено(ДокументОснование),ДокументОснование.ТипСборки,Перечисления.ТипСборки.ПустаяСсылка());
			
				Движение = Движения.ХранениеЗСЯПоТоварам.ДобавитьПриход();
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Документ = Строка.Заказ;
				Движение.Товар = Строка.Товар;
				Движение.Партия = Строка.Партия;
				Движение.ЗСЯ = Строка.ЗСЯ;
				Движение.Количество = Строка.Количество; 				
			КонецЕсли;
		КонецЦикла;
		Движения.ТоварыКСборке.Записать();
		Движения.ХранениеЗСЯПоТоварам.Записать();
		
		#Область Старое
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	КомплектацияЗаказовКомплектация.Заказ,
		//|	КомплектацияЗаказовКомплектация.Ссылка.Склад,
		//|	КомплектацияЗаказовКомплектация.ЗСЯ
		//|ПОМЕСТИТЬ втСобранныеЗаказы
		//|ИЗ
		//|	Документ.КомплектацияЗаказов.Комплектация КАК КомплектацияЗаказовКомплектация
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКСборке.Остатки(, Документ В (&МассивЗАказов)) КАК ТоварыКСборкеОстатки
		//|		ПО КомплектацияЗаказовКомплектация.Заказ = ТоварыКСборкеОстатки.Документ
		//|			И (ТоварыКСборкеОстатки.КоличествоНаКомплектацииОстаток > 0
		//|				ИЛИ ТоварыКСборкеОстатки.КоличествоКСборкеОстаток > 0)
		//|ГДЕ
		//|	ТоварыКСборкеОстатки.Документ ЕСТЬ NULL 
		//|	И КомплектацияЗаказовКомплектация.Ссылка = &Ссылка
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	КомплектацияЗаказовКомплектация.Заказ,
		//|	КомплектацияЗаказовКомплектация.Ссылка.Склад,
		//|	КомплектацияЗаказовКомплектация.ЗСЯ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	втСобранныеЗаказы.Заказ,
		//|	КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.ЗСЯ.Отдел КАК Склад,
		//|	КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.ЗСЯ
		//|ПОМЕСТИТЬ втСобранныеЗаказыИЗСЯ
		//|ИЗ
		//|	втСобранныеЗаказы КАК втСобранныеЗаказы
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.СрезПоследних КАК КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних
		//|		ПО втСобранныеЗаказы.Заказ = КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.Заказ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	втСобранныеЗаказыИЗСЯ.Заказ,
		//|	втСобранныеЗаказыИЗСЯ.Склад,
		//|	втСобранныеЗаказыИЗСЯ.ЗСЯ,
		//|	1 КАК Количество,
		//|	ЗаказТовар.Товар,
		//|	СУММА(ЗаказТовар.Количество) КАК Количество1
		//|ПОМЕСТИТЬ втВТ
		//|ИЗ
		//|	втСобранныеЗаказыИЗСЯ КАК втСобранныеЗаказыИЗСЯ
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ХранениеЗСЯ.Остатки(
		//|				,
		//|				Заказ В
		//|					(ВЫБРАТЬ
		//|						втСобранныеЗаказы.Заказ
		//|					ИЗ
		//|						втСобранныеЗаказы КАК втСобранныеЗаказы)) КАК ХранениеЗСЯОстатки
		//|		ПО втСобранныеЗаказыИЗСЯ.Заказ = ХранениеЗСЯОстатки.Заказ
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказ.Товар КАК ЗаказТовар
		//|		ПО втСобранныеЗаказыИЗСЯ.Заказ = ЗаказТовар.Ссылка
		//|ГДЕ
		//|	ХранениеЗСЯОстатки.Заказ ЕСТЬ NULL 
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	втСобранныеЗаказыИЗСЯ.Заказ,
		//|	втСобранныеЗаказыИЗСЯ.Склад,
		//|	втСобранныеЗаказыИЗСЯ.ЗСЯ,
		//|	ЗаказТовар.Товар
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	втВТ.Заказ,
		//|	втВТ.Склад,
		//|	втВТ.ЗСЯ,
		//|	втВТ.Количество,
		//|	втВТ.Количество1,
		//|	СУММА(ТоварыКСборкеОбороты.КоличествоНаКомплектацииПриход + ТоварыКСборкеОбороты.КоличествоНеХватилоПриход) КАК Количество2,
		//|	ВЫБОР
		//|		КОГДА СУММА(ТоварыКСборкеОбороты.КоличествоНеХватилоОборот) = 0
		//|			ТОГДА ЛОЖЬ
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ КАК ЕстьНеХватило
		//|ПОМЕСТИТЬ втВТ2
		//|ИЗ
		//|	втВТ КАК втВТ
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКСборке.Обороты КАК ТоварыКСборкеОбороты
		//|		ПО втВТ.Заказ = ТоварыКСборкеОбороты.Документ
		//|			И втВТ.Товар = ТоварыКСборкеОбороты.Товар
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	втВТ.Заказ,
		//|	втВТ.Склад,
		//|	втВТ.ЗСЯ,
		//|	втВТ.Количество1,
		//|	втВТ.Количество
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	втВТ2.Заказ,
		//|	втВТ2.Склад,
		//|	втВТ2.ЗСЯ,
		//|	втВТ2.Количество,
		//|	МАКСИМУМ(втВТ2.ЕстьНеХватило) КАК ЕстьНеХватило
		//|ИЗ
		//|	втВТ2 КАК втВТ2
		//|ГДЕ
		//|	втВТ2.Количество2 >= втВТ2.Количество1
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	втВТ2.Заказ,
		//|	втВТ2.Склад,
		//|	втВТ2.ЗСЯ,
		//|	втВТ2.Количество";
		//Запрос.УстановитьПараметр("Ссылка",Ссылка);
		//Запрос.УстановитьПараметр("МассивЗАказов",Комплектация.ВыгрузитьКолонку("Заказ"));
		//Выборка = Запрос.Выполнить().Выбрать();
		//Пока Выборка.Следующий() цикл
		//	Движение = Движения.ХранениеЗСЯ.ДобавитьПриход();
		//	ЗаполнитьЗначенияСвойств(Движение,Выборка);
		//	Движение.Период = Дата;
		//	Заказ = Выборка.Заказ.ПолучитьОбъект();
		//	Если Выборка.ЕстьНеХватило тогда
		//		Заказ.Собран = Ложь;				
		//		Заказ.СтатусыОбработкиЗаказа = справочники.СтатусыОбработкиЗаказа.НайтиПоКоду(4);
		//		Заказ.ДополнительныеСвойства.Вставить("ПометитьНаОбмен");
		//		Заказ.Записать(РежимЗаписиДокумента.Проведение);
		//	Иначе
		//		Заказ.СтатусыОбработкиЗаказа = справочники.СтатусыОбработкиЗаказа.НайтиПоКоду(10);
		//		Заказ.Собран = Истина;
		//		Заказ.ДополнительныеСвойства.Вставить("ПометитьНаОбмен");
		//		Если ДокументОснование.ТипСборки = перечисления.ТипСборки.СборкаЗаказовИзКоробки тогда
		//			Заказ.ДополнительныеСвойства.Вставить("ОтправитьСМС");				
		//		КонецЕсли;
		//		Заказ.Записать(РежимЗаписиДокумента.Проведение);
		//		Заказ.СтатусыОбработкиЗаказа = справочники.СтатусыОбработкиЗаказа.НайтиПоКоду(21);
		//		Заказ.Записать(РежимЗаписиДокумента.Проведение);
		//	КонецЕсли;
		//КонецЦикла;
		#КонецОбласти
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомплектацияЗаказовКомплектация.Заказ
		|ПОМЕСТИТЬ втЗаказы
		|ИЗ
		|	Документ.КомплектацияЗаказов.Комплектация КАК КомплектацияЗаказовКомплектация
		|ГДЕ
		|	КомплектацияЗаказовКомплектация.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	КомплектацияЗаказовКомплектация.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХранениеЗСЯПоТоварамОстатки.Документ КАК Документ,
		|	ХранениеЗСЯПоТоварамОстатки.Товар,
		|	СУММА(ХранениеЗСЯПоТоварамОстатки.КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ втСобранныйТоварПоЗаказам
		|ИЗ
		|	РегистрНакопления.ХранениеЗСЯПоТоварам.Остатки(
		|			&Период,
		|			Документ В
		|				(ВЫБРАТЬ
		|					втЗаказы.Заказ
		|				ИЗ
		|					втЗаказы КАК втЗаказы)) КАК ХранениеЗСЯПоТоварамОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ХранениеЗСЯПоТоварамОстатки.Документ,
		|	ХранениеЗСЯПоТоварамОстатки.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказТовар.Ссылка КАК Ссылка,
		|	ЗаказТовар.Товар,
		|	СУММА(ЗаказТовар.Количество) КАК Количество
		|ПОМЕСТИТЬ втКоличествоЗаказов
		|ИЗ
		|	Документ.Заказ.Товар КАК ЗаказТовар
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗаказы КАК втЗаказы
		|		ПО ЗаказТовар.Ссылка = втЗаказы.Заказ
		|ГДЕ
		|	НЕ ЗаказТовар.Товар.ВиртуальныйТовар
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказТовар.Ссылка,
		|	ЗаказТовар.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втКоличествоЗаказов.Ссылка
		|ПОМЕСТИТЬ втНеСобранныеЗаказы
		|ИЗ
		|	втКоличествоЗаказов КАК втКоличествоЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСобранныйТоварПоЗаказам КАК втСобранныйТоварПоЗаказам
		|		ПО втКоличествоЗаказов.Ссылка = втСобранныйТоварПоЗаказам.Документ
		|			И втКоличествоЗаказов.Товар = втСобранныйТоварПоЗаказам.Товар
		|ГДЕ
		|	втКоличествоЗаказов.Количество - ЕСТЬNULL(втСобранныйТоварПоЗаказам.Количество, 0) > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыКСборкеОстатки.Документ
		|ИЗ
		|	РегистрНакопления.ТоварыКСборке.Остатки(
		|			&Период,
		|			Документ В
		|				(ВЫБРАТЬ
		|					втЗаказы.Заказ
		|				ИЗ
		|					втЗаказы КАК втЗаказы)) КАК ТоварыКСборкеОстатки
		|ГДЕ
		|	(ТоварыКСборкеОстатки.КоличествоКСборкеОстаток > 0
		|			ИЛИ ТоварыКСборкеОстатки.КоличествоНаКомплектацииОстаток > 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКСборкеОстатки.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаказы.Заказ
		|ПОМЕСТИТЬ втСобранныеЗаказы
		|ИЗ
		|	втЗаказы КАК втЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНеСобранныеЗаказы КАК втНеСобранныеЗаказы
		|		ПО втЗаказы.Заказ = втНеСобранныеЗаказы.Ссылка
		|ГДЕ
		|	втНеСобранныеЗаказы.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКСборкеОбороты.Документ
		|ПОМЕСТИТЬ втЗаказыСНехватило
		|ИЗ
		|	РегистрНакопления.ТоварыКСборке.Обороты(
		|			,
		|			,
		|			,
		|			Документ В
		|				(ВЫБРАТЬ
		|					втЗаказы.Заказ
		|				ИЗ
		|					втЗаказы КАК втЗаказы)) КАК ТоварыКСборкеОбороты
		|ГДЕ
		|	ТоварыКСборкеОбороты.КоличествоНеХватилоПриход <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКСборкеОбороты.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСобранныеЗаказы.Заказ,
		|	ВЫБОР
		|		КОГДА втЗаказыСНехватило.Документ ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьНеХватило
		|ИЗ
		|	втСобранныеЗаказы КАК втСобранныеЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЗаказыСНехватило КАК втЗаказыСНехватило
		|		ПО втСобранныеЗаказы.Заказ = втЗаказыСНехватило.Документ";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("Период",Новый Граница(МоментВремени(),ВидГраницы.Включая));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			СтатусыДокументов.УстановитьСтатусСборкиЗаказа(Выборка.Заказ,Ссылка,Справочники.СтатусыОбработкиЗаказа.ЗаказВТочкеСамовывоза,Сотрудник,Дата);
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры
